snlkuharlocal/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВУ</name>
    <comment>Номер водительского удостоверения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение (Периодический реквизит)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительныйПадеж</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АссистентМенеджера</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПодразделенияУСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомерСотрудникаЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускВездеход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПродаж</name>
    <comment>Работник склада забронирован данным подразделением ЦО</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобренСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ФизическиеЛица/ObjectModule.bsl
Перем мДлинаСуток;

// Кухарь А.Ю. 31.03.2021 начало
// Обработкой на складе заполняют сектора, которые не нужны в базе ЦО
перем ЗаписыватьБезКонтроля; 
// Кухарь А.Ю. 31.03.2021 конец


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриКопировании(ОбъектКопирования)	
	Если Не ЭтоГруппа Тогда
		ОсновноеИзображение = Неопределено;
	КонецЕсли;	
КонецПроцедуры


Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры

// Кухарь А.Ю. 31.03.2021 начало
// Обработкой на складе заполняют сектора, которые не нужны в базе ЦО
Процедура ЗаписатьБезКонтроля () экспорт
	ЗаписыватьБезКонтроля=Истина;
	Записать();
	ЗаписыватьБезКонтроля=Ложь;
КонецПроцедуры
// Кухарь А.Ю. 31.03.2021 конец


  //крохин начало
  Процедура ПриЗаписи(Отказ)
	  //крохин начало
	  //Если НЕ ОбменДанными.Загрузка И НЕ РольДоступна("Администратор") Тогда
	  //заводить водителей на складе можно
	  Если НЕ ОбменДанными.Загрузка И НЕ РольДоступна("Администратор") И не РольДоступна("ОператорСклад") Тогда
		  //крохин конец	  
		  Отказ=Истина;		
	  КонецЕсли; 
		
КонецПроцедуры
 //крохин конец
 
 //крохин начало 19.05.2011
//на складе разраем вводить сторонних физлиц
Процедура ПередЗаписью(Отказ)

	// нечаева +++ 28,05,13
	//крохин начало 29.05.2013
	//УстановитьШК();
	Если НЕ ЭтоГруппа Тогда
	УстановитьШК();
	КонецЕсли;	
	//крохин конец 29.05.2013
	// нечаева --- 28,05,13
	
	// Кухарь А.Ю. 31.03.2021 начало
	// 	Если НЕ ОбменДанными.Загрузка И НЕ РольДоступна("Администратор") Тогда
	Если НЕ ОбменДанными.Загрузка И НЕ РольДоступна("Администратор") и ЗаписыватьБезКонтроля<>Истина Тогда
	// Кухарь А.Ю. 31.03.2021 конец
	
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Сторонние = Справочники.ФизическиеЛица.НайтиПоКоду("SNL-01032");
			Если НЕ ЭтотОбъект.ПринадлежитЭлементу(Сторонние) Тогда
				сообщить("на складе возможно заведение физлиц только в группу ""сторонние"" ");
				Отказ = Истина;
			КонецЕсли;
		Конецесли;
	Конецесли;
	// нечаева 07,10,13 +++ фамилию пишем, только если это не группа
	Если (Модифицированность() И НЕ ОбменДанными.Загрузка)и (НЕ ЭтоГруппа) Тогда
		ФИО = Наименование;
		
		Если ПустаяСтрока(Фамилия) ИЛИ ЭтоНовый() Тогда
			Фамилия  = ВыделитьСлово(ФИО);
			Имя      = ВыделитьСлово(ФИО);
			Отчество = ВыделитьСлово(ФИО);
		КонецЕсли;
	КонецЕсли;
	// нечаева 07,10,13 ---
	
	//крохин начало 31.05.2019
//вместо авторегистрации изменений
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
//крохин конец 31.05.2019

КонецПроцедуры
//крохин конец 19.05.2011


Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции



 // нечаева +++ 28,05,13	
 Процедура  УстановитьШК()
		 
	 Если НЕ ПустаяСтрока(ЭтотОбъект.ШтрихКод) тогда
		 возврат;
		 //сообщить("Штрих-код уже установлен, очистите поле ШК перед установкой нового");
	 Иначе 
		 
		 //Запрос=Новый Запрос;
		 //Запрос.Текст="
		 //|ВЫБРАТЬ ПЕРВЫЕ 1
		 //|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) КАК НомерШК
		 //|ИЗ
		 //|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		 //|ГДЕ 
		 //|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 1, 3)=""777""
		 //|УПОРЯДОЧИТЬ ПО 
		 //|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 4, 9) УБЫВ";
		 //
		 //Выборка=Запрос.Выполнить().Выбрать();
		 //Если Выборка.Следующий() Тогда
		 //    НомерШК =  Число(Выборка.НомерШК);	
		 //Иначе
		 //    НомерШК = "000000000";
		 //КонецЕсли; 
		 //
		 //НомерШК=НомерШК+1;
		 ////крохин начало 16.06.2018
		 ////разные префиксы для ЦО и склад
		 ////ШтрихКод = "777" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
		 //Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		 //    ШтрихКод = "777" + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
		 //Иначе
		 //    // Кухарь А.Ю.  26.06.2024 начало
		 //    //ШтрихКод = Прав(ПараметрыСеанса.ЭтотУзел.Подразделение.Код,3) + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
		 //    ШтрихКод = Прав(СокрЛП(ПараметрыСеанса.ЭтотУзел.Подразделение.Код),3) + Формат(НомерШК,"ЧЦ=9; ЧРГ=; ЧВН=; ЧГ=0");
		 //    // Кухарь А.Ю.  26.06.2024 конец
		 //    
		 //    КонецЕсли;
		 ////крохин конец 16.06.2018   
		 //Валетов + 22,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7509 Поменял во всех местах с 770 на 7772 и 771 на 7774 и числа частей в запросе.		
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 5, 8) КАК НомерШК
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
			Запрос.Текст = Запрос.Текст +"
			|ГДЕ 
			|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 1, 4)=""7772""
			|УПОРЯДОЧИТЬ ПО 
			|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 5, 8) УБЫВ";	
		Иначе
			Запрос.Текст = Запрос.Текст +"
			|ГДЕ 
			|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 1, 4)=""7774""
			|УПОРЯДОЧИТЬ ПО 
			|	ПОДСТРОКА(ФизическиеЛица.ШтрихКод, 5, 8) УБЫВ";
		КонецЕсли;
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НомерШК =  Число(Выборка.НомерШК);	
		Иначе
			НомерШК = "00000000";
		КонецЕсли; 
		
		НомерШК=НомерШК+1;
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда		
			Префикс = "7772";
		Иначе
			Префикс = "7774";
		КонецЕсли;
		
		ШтрихКод = СокрЛП(Префикс) + Формат(НомерШК,"ЧЦ=8; ЧРГ=; ЧВН=; ЧГ=0");
		//Валетов -
		 ШтрихКод = ШтрихКод + КонтрольныйСимволEAN(Число(ШтрихКод),13);
		 ЭтотОбъект.ШтрихКод= ШтрихКод;
		 
	 КонецЕсли;
	 
		
КонецПроцедуры
	
// нечаева --- 28,05,13




////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
